#ifndef NETDEFINE_H
#define NETDEFINE_H

#define MAX_ID  1000000
#define MAX_PORT    65535

#define DEFAULT_ID  4
#define DEFAULT_ADRESS  "127.0.0.1"
#define DEFAULT_PORT  26

#define NET_SETTINGS_DEVICES    "DEVICES"
#define NET_SETTINGS_PANEL_ID   "DEVICE_PANEL/ID"
#define NET_SETTINGS_DRIVE_ID   "DEVICE_DRIVE/ID"
#define NET_SETTINGS_VIDEO_ID   "DEVICE_VIDEO/ID"

/////////////////////////////////////////////////////////////////////////////////
// Основные определения протокольных констант для программы видеообработки
/////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////
// Входные коды команд для программы видеообработки

#define VP_COMMAND_INPUT_CONTROL_PANEL_BUTTON_PRESS 15 // Команда от пульта управления
#define VP_COMMAND_INPUT_DRIVES						16 // Команда от программы управления приводами

// Контроль функционирования
#define VP_COMMAND_INPUT_SELF_CONTROL				17 // Команда на выполнение контроля функционирования

// Управление приводами
#define VP_COMMAND_INPUT_CURSOR_X					18 // Команда установки положения курсора по оси Х
#define VP_COMMAND_INPUT_CURSOR_Y					19 // Команда установки положения курсора по оси Y

#define VP_COMMAND_INPUT_VIZIR_X					20 // Команда установки положения визира по оси Х
#define VP_COMMAND_INPUT_VIZIR_Y					21 // Команда установки положения визира по оси Y

/////////////////////////////////////////////////////////////////////////////////
// Выходные коды команд для программы видеообработки

#define VP_COMMAND_OUTPUT_SELF_CONTROL				22 // Команда-отчет о выполнении контроля функционирования


/////////////////////////////////////////////////////////////////////////////////
// Аргументы входных команд от пульта управления
/////////////////////////////////////////////////////////////////////////////////

// Это аргументы для команд типа (DEVICE_PANEL | VP_COMMAND_INPUT_CONTROL_PANEL | Arg1 | Arg 2)

// Команды включения режимов
#define VP_SWITCH_MODE_MULTI					11 // "Мультиэкран"
#define VP_SWITCH_MODE_VIZIR					12 // "Визир"
#define VP_SWITCH_MODE_CAMERA					13 // "Камера"
#define VP_SWITCH_MODE_PAN						14 // "Панорама"

// Команды управления
#define VP_SELECT_CAMERA_1						15 // Выбор камеры номер 1 (в режимах "Камера" и "Мультиэкран")
#define VP_SELECT_CAMERA_2						16 // Выбор камеры номер 2 (в режимах "Камера" и "Мультиэкран")
#define VP_SELECT_CAMERA_3						17 // Выбор камеры номер 3 (в режимах "Камера" и "Мультиэкран")
#define VP_SELECT_CAMERA_4						18 // Выбор камеры номер 4 (в режимах "Камера" и "Мультиэкран")

#define VP_SELECT_CAMERA_AUTO					19 // Автоматический выбор камеры по положению курсора(в режимах "Камера" и "Мультиэкран")
#define VP_SELECT_CAMERA_SEQ					20 // Автоматическая ротация выбранных камер с интервалом 5 секунд (в режимах "Камера" и "Мультиэкран")
#define VP_CAMERA_ZOOM_IN						21 // Увеличение цифрового зума камеры на 0.25 (максимальный - 5) (в режимах "Камера" и "Мультиэкран")
#define VP_CAMERA_ZOOM_OUT						22 // Уменьшение цифрового зума камеры на 0.25 (минимальный  - 1) (в режимах "Камера" и "Мультиэкран")

#define VP_SET_DAY_NIGHT						8  // Переключение режима между днем и ночью (принцип качелей)

#endif // NETDEFINE_H
